notes/d-compile-time-regex.org
#+TITLE: D言語でコンパイル時に動く正規表現エンジンを作る
#+AUTHOR: Shigeki Karita
#+LANGUAGE: ja
#+OPTIONS: toc:t num:t H:4 ^:nil pri:t author:t creator:t timestamp:t email:nil
#+HTML_MATHJAX:  path:"MathJax/MathJax.js?config=TeX-AMS_HTML"


* はじめに

tl;dr 実装見てください https://github.com/ShigekiKarita/d-fsa/tree/v0.0.1

皆さんは正規表現つかってますか?正直に言うと私はgrepとかsedコマンドでときどき使うくらいで，まともに勉強したことはありませんでした．そもそもD言語で正規表現を使ったことがない人も多いかもしれません．もし興味があれば，この機会にD言語向けの解説を見てみてはいかがでしょうか，かなり面白いです．

- 2016年のAC (@kubo39さん) [[https://qiita.com/kubo39/items/0cd4b0bc05c0a7b27450][std.regexについて少し書いた]]
- 公式ページの解説 (英語) [[https://dlang.org/articles/regular-expression.html][Regular Expressions]]

ただし今回こういった前提知識は必要ありません．私が実装した正規表現エンジンは高速でもなければ，機能もマッチしてるか判定するだけなので実用性はないです．ただ，コンパイル時にマッチするか判定できるだけです．この記事を読んで得られるのは，ちょっとした正規表現エンジンの仕組みと，D言語で複雑なコードをコンパイル時に動かすtipsくらいです．

* 動機：ctRegexがコンパイル時にマッチできない

そもそもD言語にはstd.regex.ctRegexというコンパイル時正規表現エンジンがあるのですが，パターンのコンパイルはできてもマッチなどの操作はコンパイル時は動きません．

#+begin_src d
import std.regex;

void main() {
    // 公式ドキュメントの例をauto -> static constに
    // Error: cannot convert `&immutable(Regex!char)` to `Regex!char*` at compile time ...
    static const ctr = ctRegex!(`^.*/([^/]+)/?$`);
    static const c2 = matchFirst("foo/bar", ctr);   // First match found here, if any
    static assert(!c2.empty);   // Be sure to check if there is a match before examining contents!
    static assert(c2[1] == "bar");   // Captures is a range of submatches: 0 = full match.
}

#+end_src

https://wandbox.org/permlink/akVd9OiDJbBJwIN5

動かすとコンパイラのバグなのでレポートしてねと出てきます(してない...)．

https://github.com/dlang/phobos/tree/v2.083.0/std/regex/internal

ちなみにDの標準ライブラリにある正規表現にはBackTracking(またはvirtual machineともいう)と，Thompson NFAアルゴリズムを使った２つの実装があります．私の理解が正しければ，ctRegexの方は[[https://github.com/dlang/phobos/blob/262d59f5b534c0ffe39adbfeed69e42c169fe2b6/std/regex/package.d#L439][BackTrackingによる実装]]になっているはずです．同じように作っても面白くないし，コンパイル時実行が難しいかもしれないので，今回はNFAベースの実装をやっていきます．


** コンパイル時実行(CTFE)とは

ところでコンパイル時の値（定数のみ）は次の方法で作れます．

#+begin_src d
// 実行時は参照できない定数値 (manifest constant)，右辺値になる
// https://dlang.org/spec/enum.html#manifest_constants
enum e = 1;
// 実行時も参照できる定数値，左辺値，アドレスもとれる．コンパイル時に初期化される
static const c = 1;
#+end_src

- 補足：簡単なCTFE入門 https://tour.dlang.org/tour/ja/gems/compile-time-function-evaluation-ctfe

コンパイル時に動く最も重要な条件の一つは純粋な操作しかできないということです．副作用があるとstatic const/immutableな値にできないので，できる限り純粋(pure)な実装を心がけます．もし可変な状態を持つ操作が必要なときは使い捨てのオブジェクト(例えばrangeオブジェクトみたいな)にして分離すると，D言語では定数回の可変な操作は純粋に行えるので，コンパイル時に動きやすいかと思います(C++14のconstexprと同じ)．

この考え方を一般化するとmutableな操作をラムダ式内部で閉じて行うパターンに行き着きます．余談ですが私はこれを"precomputedパターン"と勝手に読んでます．下記のようなパターンはD言語のコードで非常によくでてきます．
#+begin_src d
// 副作用のある関数
void mutate(ref int i) { ++i; }

void main() {
    // コンパイル時に決定的に動けば副作用も使える
    enum a = { int x = 0; mutate(x); return x; }();
    static assert(a == 1);
}
#+end_src

解説 https://p0nce.github.io/d-idioms/#Precomputed-tables-at-compile-time-through-CTFE

CTFEのための第二の条件としては，結局はD言語コンパイラの実装による部分が多い感じもします．ただDMDで動けばLDCやGDCも同じフロントエンドを使っているので多くの場合困らないです．そういうわけで実際には少しずつコンパイル時に動くテストを書いた部品を組み合わせて，大きなコンパイル時に動く正規表現エンジンを作っていくのが重要です．

* 実装

「正規表現エンジンを作ろう」　https://codezine.jp/article/corner/237

このサイトの実装解説がとてもわかりやすかったので，とくに事前知識がなくても只管PythonをD言語に変換していきました．私の理解ではエンジンの内部処理は大まかには以下の3ステージで実装できます．これらを全部コンパイル時にできれば良いというわけです．

- パターン文字列(e.g., "(abc|ABC)*")から構文木への変換 (パーサ/レキサー)
- 構文木からNFAへの変換
- NFAからDFAへの変換

とくに二番目のNFAへの変換が難しいのですが，色々なアルゴリズムが提案されているので，調べてみると面白いです．今回は[[https://swtch.com/~rsc/regexp/regexp1.html][Thompson NFA]]の派生らしいです．余談ですが，D言語の標準std.regexもThompson NFAベースなので後日コードを読んで理解できるようになりました．

ところで，わざわざNFAからDFAに変換する理由は，DFAは構築には「正規表現の長さm」に対して指数時間O(2^m)かかるのですが，「入力文字列の長さn」の線形時間O(n)でマッチできるため高速だからです．一方NFAを直接使う場合はO(mn)かかります．マッチは何度もしますが，構築は一度しかしないのでDFAの方が効率的だろうというのがポイントだと思います．ここで重要な前提として正規表現を変換した等価なNFAやDFAによって受理されるかというのが，正規表現がマッチしたかどうかという判定と等価になるという考え方です．よくわからなくても次の節をみてください．

