notes/d-compile-time-regex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-04-18 Sat 20:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>D言語でコンパイル時に動く正規表現エンジンを作る</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeki Karita" />
<link rel="stylesheet" type="text/css" href="/css/org.css"/>
 <link href="/css/code.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">D言語でコンパイル時に動く正規表現エンジンを作る</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org28c81f4">1. はじめに</a></li>
<li><a href="#org00cc22f">2. 動機：ctRegexがコンパイル時にマッチできない</a>
<ul>
<li><a href="#org4d576ce">2.1. コンパイル時実行(CTFE)とは</a></li>
</ul>
</li>
<li><a href="#org5a00c2e">3. 実装</a>
<ul>
<li><a href="#org44a813a">3.1. コンパイル時NFA</a></li>
<li><a href="#org6dffcab">3.2. コンパイル時Set</a></li>
<li><a href="#org0aa9ae8">3.3. コンパイル時DFA</a></li>
<li><a href="#org5caac97">3.4. 残りの部分を書く</a>
<ul>
<li><a href="#org65ce224">3.4.1. 字句解析</a></li>
<li><a href="#orgc4ecbaf">3.4.2. 構文解析</a></li>
<li><a href="#org5fb3aa7">3.4.3. 抽象構文木(AST)</a></li>
<li><a href="#orgb1e1c5b">3.4.4. NFAからDFAへの変換</a></li>
<li><a href="#orgcf12131">3.4.5. 正規表現のマッチ：受理判定</a></li>
</ul>
</li>
<li><a href="#org80f84e7">3.5. 動作検証</a></li>
</ul>
</li>
<li><a href="#org211d8d8">4. まとめと課題</a></li>
</ul>
</div>
</div>


<div id="outline-container-org28c81f4" class="outline-2">
<h2 id="org28c81f4"><span class="section-number-2">1</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
tl;dr 実装見てください <a href="https://github.com/ShigekiKarita/d-fsa/tree/v0.0.1">https://github.com/ShigekiKarita/d-fsa/tree/v0.0.1</a>
</p>

<p>
皆さんは正規表現つかってますか?正直に言うと私はgrepとかsedコマンドでときどき使うくらいで，まともに勉強したことはありませんでした．そもそもD言語で正規表現を使ったことがない人も多いかもしれません．もし興味があれば，この機会にD言語向けの解説を見てみてはいかがでしょうか，かなり面白いです．
</p>

<ul class="org-ul">
<li>2016年のAC (@kubo39さん) <a href="https://qiita.com/kubo39/items/0cd4b0bc05c0a7b27450">std.regexについて少し書いた</a></li>
<li>公式ページの解説 (英語) <a href="https://dlang.org/articles/regular-expression.html">Regular Expressions</a></li>
</ul>

<p>
ただし今回こういった前提知識は必要ありません．私が実装した正規表現エンジンは高速でもなければ，機能もマッチしてるか判定するだけなので実用性はないです．ただ，コンパイル時にマッチするか判定できるだけです．この記事を読んで得られるのは，ちょっとした正規表現エンジンの仕組みと，D言語で複雑なコードをコンパイル時に動かすtipsくらいです．
</p>
</div>
</div>

<div id="outline-container-org00cc22f" class="outline-2">
<h2 id="org00cc22f"><span class="section-number-2">2</span> 動機：ctRegexがコンパイル時にマッチできない</h2>
<div class="outline-text-2" id="text-2">
<p>
そもそもD言語にはstd.regex.ctRegexというコンパイル時正規表現エンジンがあるのですが，パターンのコンパイルはできてもマッチなどの操作はコンパイル時は動きません．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> std.<span class="org-type">regex</span>;

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#20844;&#24335;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20363;&#12434;auto -&gt; static const&#12395;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">Error: cannot convert `&amp;immutable(Regex!char)` to `Regex!char*` at compile time ...</span>
    <span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-variable-name">ctr</span> = ctRegex<span class="org-negation-char">!</span>(<span class="org-string">`^.*/([^/]+)/?$`</span>);
    <span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-variable-name">c2</span> = matchFirst(<span class="org-string">"foo/bar"</span>, ctr);   <span class="org-comment-delimiter">// </span><span class="org-comment">First match found here, if any</span>
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(<span class="org-negation-char">!</span>c2.empty);   <span class="org-comment-delimiter">// </span><span class="org-comment">Be sure to check if there is a match before examining contents!</span>
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(c2[1] == <span class="org-string">"bar"</span>);   <span class="org-comment-delimiter">// </span><span class="org-comment">Captures is a range of submatches: 0 = full match.</span>
}

</pre>
</div>

<p>
<a href="https://wandbox.org/permlink/akVd9OiDJbBJwIN5">https://wandbox.org/permlink/akVd9OiDJbBJwIN5</a>
</p>

<p>
動かすとコンパイラのバグなのでレポートしてねと出てきます(してない&#x2026;)．
</p>

<p>
<a href="https://github.com/dlang/phobos/tree/v2.083.0/std/regex/internal">https://github.com/dlang/phobos/tree/v2.083.0/std/regex/internal</a>
</p>

<p>
ちなみにDの標準ライブラリにある正規表現にはBackTracking(またはvirtual machineともいう)と，Thompson NFAアルゴリズムを使った２つの実装があります．私の理解が正しければ，ctRegexの方は<a href="https://github.com/dlang/phobos/blob/262d59f5b534c0ffe39adbfeed69e42c169fe2b6/std/regex/package.d#L439">BackTrackingによる実装</a>になっているはずです．同じように作っても面白くないし，コンパイル時実行が難しいかもしれないので，今回はNFAベースの実装をやっていきます．
</p>
</div>


<div id="outline-container-org4d576ce" class="outline-3">
<h3 id="org4d576ce"><span class="section-number-3">2.1</span> コンパイル時実行(CTFE)とは</h3>
<div class="outline-text-3" id="text-2-1">
<p>
ところでコンパイル時の値（定数のみ）は次の方法で作れます．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-comment-delimiter">// </span><span class="org-comment">&#23455;&#34892;&#26178;&#12399;&#21442;&#29031;&#12391;&#12365;&#12394;&#12356;&#23450;&#25968;&#20516; (manifest constant)&#65292;&#21491;&#36794;&#20516;&#12395;&#12394;&#12427;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">https://dlang.org/spec/enum.html#manifest_constants</span>
<span class="org-keyword">enum</span> <span class="org-type">e</span> = 1;
<span class="org-comment-delimiter">// </span><span class="org-comment">&#23455;&#34892;&#26178;&#12418;&#21442;&#29031;&#12391;&#12365;&#12427;&#23450;&#25968;&#20516;&#65292;&#24038;&#36794;&#20516;&#65292;&#12450;&#12489;&#12524;&#12473;&#12418;&#12392;&#12428;&#12427;&#65294;&#12467;&#12531;&#12497;&#12452;&#12523;&#26178;&#12395;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;</span>
<span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-variable-name">c</span> = 1;
</pre>
</div>

<ul class="org-ul">
<li>補足：簡単なCTFE入門 <a href="https://tour.dlang.org/tour/ja/gems/compile-time-function-evaluation-ctfe">https://tour.dlang.org/tour/ja/gems/compile-time-function-evaluation-ctfe</a></li>
</ul>

<p>
コンパイル時に動く最も重要な条件の一つは純粋な操作しかできないということです．副作用があるとstatic const/immutableな値にできないので，できる限り純粋(pure)な実装を心がけます．もし可変な状態を持つ操作が必要なときは使い捨てのオブジェクト(例えばrangeオブジェクトみたいな)にして分離すると，D言語では定数回の可変な操作は純粋に行えるので，コンパイル時に動きやすいかと思います(C++14のconstexprと同じ)．
</p>

<p>
この考え方を一般化するとmutableな操作をラムダ式内部で閉じて行うパターンに行き着きます．余談ですが私はこれを"precomputedパターン"と勝手に読んでます．下記のようなパターンはD言語のコードで非常によくでてきます．
</p>
<div class="org-src-container">
<pre class="src src-d"><span class="org-comment-delimiter">// </span><span class="org-comment">&#21103;&#20316;&#29992;&#12398;&#12354;&#12427;&#38306;&#25968;</span>
<span class="org-type">void</span> <span class="org-function-name">mutate</span>(<span class="org-keyword">ref</span> <span class="org-type">int</span> <span class="org-variable-name">i</span>) { ++i; }

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#12467;&#12531;&#12497;&#12452;&#12523;&#26178;&#12395;&#27770;&#23450;&#30340;&#12395;&#21205;&#12369;&#12400;&#21103;&#20316;&#29992;&#12418;&#20351;&#12360;&#12427;</span>
    <span class="org-keyword">enum</span> <span class="org-type">a</span> = { <span class="org-type">int</span> x = 0; mutate(x); <span class="org-keyword">return</span> x; }();
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(a == 1);
}
</pre>
</div>

<p>
解説 <a href="https://p0nce.github.io/d-idioms/#Precomputed-tables-at-compile-time-through-CTFE">https://p0nce.github.io/d-idioms/#Precomputed-tables-at-compile-time-through-CTFE</a>
</p>

<p>
CTFEのための第二の条件としては，結局はD言語コンパイラの実装による部分が多い感じもします．ただDMDで動けばLDCやGDCも同じフロントエンドを使っているので多くの場合困らないです．そういうわけで実際には少しずつコンパイル時に動くテストを書いた部品を組み合わせて，大きなコンパイル時に動く正規表現エンジンを作っていくのが重要です．
</p>
</div>
</div>
</div>

<div id="outline-container-org5a00c2e" class="outline-2">
<h2 id="org5a00c2e"><span class="section-number-2">3</span> 実装</h2>
<div class="outline-text-2" id="text-3">
<p>
「正規表現エンジンを作ろう」　<a href="https://codezine.jp/article/corner/237">https://codezine.jp/article/corner/237</a>
</p>

<p>
このサイトの実装解説がとてもわかりやすかったので，とくに事前知識がなくても只管Pythonコードをコンパイル時に動くD言語のコードに変換していくことで実装しました．私の理解ではエンジンの内部処理は大まかには以下の3ステージで実装できます．これらを全部コンパイル時にできれば良いというわけです．
</p>

<ul class="org-ul">
<li>パターン文字列(e.g., "(abc|ABC)*")から構文木への変換 (パーサ/レキサー)</li>
<li>構文木からNFAへの変換</li>
<li>NFAからDFAへの変換</li>
</ul>

<p>
とくに二番目のNFAへの変換が難しいのですが，色々なアルゴリズムが提案されているので，調べてみると面白いです．今回は<a href="https://swtch.com/~rsc/regexp/regexp1.html">Thompson NFA</a>の派生らしいです．
</p>

<p>
ところで最後に，わざわざNFAからDFAに変換するステップがあるのは，DFAの構築には「正規表現の長さm」に対して指数時間O(2^m)かかるのですが，「入力文字列の長さn」の線形時間O(n)でマッチできるため高速だからという理由らしいです．一方NFAを直接使う場合はO(mn)かかります．マッチは何度も実行しますが，構築は一度しかしないのでトータルでNFAよりもDFAの方が効率的だろうというのがポイントだと思います．ここで重要な前提として正規表現を変換した等価なNFAやDFAによって受理されるかというのが，正規表現がマッチしたかどうかという判定と等価になるという考え方です．もし，よくわからなくても次の節をみてください．
</p>
</div>
