notes/d-compile-time-regex.org
** コンパイル時NFA

元ネタ通りに，とりあえずNFAから作りました．簡単にNFAとは以下の3つの要素からなるオートマトンです

- 状態と入力を受け取り，遷移できる状態の集合を返す遷移表（または遷移関数）map
- 初期状態: start
- 受理状態の集合: accepts

このときはPythonのコードをもとにしたので何が入力や状態の型なのかわかってなかったので，とりあえずtemplateにしました．D言語のtemplateはスクリプト言語みたいなところがあるので，後から具体的な仕様は決めることができて楽です．

#+begin_src d
import std.typecons : Tuple, tuple;

struct NFA(State, Input) {
    alias Arc = Tuple!(State, Input);
    State start;
    Set!State accept;
    Set!State[Arc] map; // 遷移表

    // 状態と入力に応じた次に遷移できる状態の集合を返す，なければ空集合を返す
    pure Set!State transition(const State s, const Input i) const {
        return this.map.get(Arc(s, i), set!State());
    }
}

unittest {
    /**
       NFA example
        -> (0) --- a --> (1)
           ^  \           |
           |  |           b
          eps |           |
           |  |           v
           |  \--- a --> [2]
           \-------------/
    */
    alias set = Set!int;
    enum NFA!(int, string) n = {
        start: 0,
        accept: set(2),
        map: [tuple(0, "a"): set(1, 2),
              tuple(1, "b"): set(2),
              tuple(2, ""):  set(0)]
    };
    static assert(n.transition(0, "a") == set(1, 2));
}
#+end_src
この例にあるNFAは文字列abまたはaに対してマッチする(=受理状態[2]に到達する)NFAです．繰り返しはでてきませんが，マッチする複数の文字列をNFAのグラフとして扱うイメージができるかと思います．

ところで，ここで集合を表すSet型の実装に悩むことになりました．

** コンパイル時Set

D言語のstd.containerでSet(集合)として使えるのは赤黒木RedBlackTreeクラスだけだと思うのですが，コンパイル時に動きませんでした...．

#+begin_src d
import std.container;
import std.algorithm;

void main() {
    static const rbt = redBlackTree(3, 1, 4, 2, 5);
    static assert(equal(rbt[], [1, 2, 3, 4, 5])); // Error: cannot cast ...  at compile time
}
#+end_src
https://wandbox.org/permlink/sy9FhfQd5Wwd2jpt

よく考えたら，赤黒木よりもC++のstd::unordered_setのように，ハッシュテーブルを使って実装したほうがシンプルで良いかも...という思いもあり，D言語の組み込み連想配列(assoc)はコンパイル時に動くし，ハッシュテーブル実装なので，ラップして使いました．

#+begin_src d
struct Set(T) {
    struct Value {}
    Value[T] base;
    alias base this;
    
    this(T[] xs) {
        foreach (x; xs) this.base[x] = Value();
    }
}

void main() {
    enum s = Set!int([1, 2, 3]);
    static assert((1 in s) != null);
    static assert((0 in s) == null);
}
#+end_src

実装も楽だし，たぶん速いし，コンパイル時に動くし，良いことばかりですね．

** コンパイル時DFA

DFAはNFAよりも複雑な遷移をしたくなるので，連想配列による遷移表mapではなく関数transで表すことにしました．注意点として NFA の遷移関数は ~Set!State transition(State s, Input i)~ でしたが，DFAは決定的なので ~State transition(State s, Input i)~ といった具合に戻り値が必ず一つの状態になることです．D言語はちゃんとした静的型付き言語なのに，私はスクリプト言語に型が勝手につく位の使い方をしてるので，読みづらくて申し訳ないです．

#+begin_src d
struct DFA(State, Input, alias trans, Accepts = Set!State) {
    State start;
    Accepts accepts;
    alias transition = trans;
}

unittest {
    /**
       DFA example
       -> (1) -- a --> (2) -- b --> [3]
    */
    enum map = [
        tuple(1, "a"): 2,
        tuple(2, "b"): 3,
        ];

    int t(int state, string c) {
        return map.get(tuple(state, c), 0);
    }
    enum DFA!(int, string, t) d = { start: 1, accepts: Set!int([3]) };
    // 遷移してみる
    static assert(d.transition(1, "a") == 2);
    static assert((d.transition(2, "b") in dfa.accepts) != null);
}
#+end_src

NFAと同様に，最終的に正規表現がマッチしているかの判定は遷移後の状態がaccepts集合に入っているかどうかまで簡単化されるので，このくらいの実装ならコンパイル時にマッチできることがわかります．

** 残りの部分を書く

実際のところ，これ以外の部分はもうやるだけです，とくにコンパイル時に動かないということはありませんでした．アドバイスとしてはプログラムが大きくなると何をやっているのか理解できなくなる＋コンパイル時に動かなくなることが多いので，モジュールをどんどん分割して簡単な変換例をunittestとして書き続けるのが良いと思います．意外にも組み合わせるとコンパイル時に動かなくなるということはほぼなく，どこかしらが局所的にコンパイルできないことが多いです．

以下ざっくりとした実装上のポイント解説です．

*** 字句解析

https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/lexer.d

ここでは元ネタの正規表現エンジンに従って下記の数学的に使われる文法のみをサポートしました．
実用的な正規表現にでてくる + ? {} [] などは今回サポートしていませんが，それぞれ数学的な正規表現に変換できるので後回しにしてます．

#+CAPTION: 数学的な正規表現の文法
#+NAME: fig:regexp-syntax
|           | 受理する文字列           | Token列挙型     | ASTクラス名 |
|-----------+--------------------------+-----------------+-------------|
| A         | 文字                     | character       | Char        |
| A \vert B | AまたはBの集合           | opUnion         | Union       |
| AB        | AとBの連結               | なし            | Concat      |
| A*        | Aの繰り返し              | opStar          | Star        |
| (A)       | カッコ内を優先してマッチ | left/rightParen | なし        |

文字列からToken列への変換はよくあるswitch文を使ったものです．

