notes/d-compile-time-regex.html

<div id="outline-container-org44a813a" class="outline-3">
<h3 id="org44a813a"><span class="section-number-3">3.1</span> コンパイル時NFA</h3>
<div class="outline-text-3" id="text-3-1">
<p>
元ネタ通りに，とりあえずNFAから作りました．簡単にNFAとは以下の3つの要素からなるオートマトンです
</p>

<ul class="org-ul">
<li>状態と入力を受け取り，遷移できる状態の集合を返す遷移表（または遷移関数）map</li>
<li>初期状態: start</li>
<li>受理状態の集合: accepts</li>
</ul>

<p>
このときはPythonのコードをもとにしたので何が入力や状態の型なのかわかってなかったので，とりあえずtemplateにしました．D言語のtemplateはスクリプト言語みたいなところがあるので，後から具体的な仕様は決めることができて楽です．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> std.<span class="org-type">typecons</span> : Tuple, tuple;

<span class="org-keyword">struct</span> <span class="org-type">NFA</span>(<span class="org-type">State</span>, <span class="org-type">Input</span>) {
    <span class="org-keyword">alias</span> <span class="org-type">Arc</span> = Tuple<span class="org-negation-char">!</span>(State, Input);
    <span class="org-type">State</span> <span class="org-variable-name">start</span>;
    Set<span class="org-negation-char">!</span>State <span class="org-variable-name">accept</span>;
    Set<span class="org-negation-char">!</span>State[Arc] <span class="org-variable-name">map</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#36983;&#31227;&#34920;</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#29366;&#24907;&#12392;&#20837;&#21147;&#12395;&#24540;&#12376;&#12383;&#27425;&#12395;&#36983;&#31227;&#12391;&#12365;&#12427;&#29366;&#24907;&#12398;&#38598;&#21512;&#12434;&#36820;&#12377;&#65292;&#12394;&#12369;&#12428;&#12400;&#31354;&#38598;&#21512;&#12434;&#36820;&#12377;</span>
    <span class="org-keyword">pure</span> Set<span class="org-negation-char">!</span>State <span class="org-function-name">transition</span>(<span class="org-keyword">const</span> <span class="org-type">State</span> <span class="org-variable-name">s</span>, <span class="org-keyword">const</span> <span class="org-type">Input</span> <span class="org-variable-name">i</span>) <span class="org-keyword">const</span> {
        <span class="org-keyword">return</span> <span class="org-keyword">this</span>.map.get(Arc(s, i), set<span class="org-negation-char">!</span>State());
    }
}

<span class="org-keyword">unittest</span> {
    <span class="org-comment-delimiter">/**</span>
<span class="org-comment">       NFA example</span>
<span class="org-comment">        -&gt; (0) --- a --&gt; (1)</span>
<span class="org-comment">           ^  \           |</span>
<span class="org-comment">           |  |           b</span>
<span class="org-comment">          eps |           |</span>
<span class="org-comment">           |  |           v</span>
<span class="org-comment">           |  \--- a --&gt; [2]</span>
<span class="org-comment">           \-------------/</span>
<span class="org-comment">    */</span>
    <span class="org-keyword">alias</span> <span class="org-type">set</span> = Set<span class="org-negation-char">!</span><span class="org-type">int</span>;
    <span class="org-keyword">enum</span> <span class="org-type">NFA</span><span class="org-negation-char">!</span>(<span class="org-type">int</span>, <span class="org-type">string</span>) n = {
        start: 0,
        accept: set(2),
        map: [tuple(0, <span class="org-string">"a"</span>): set(1, 2),
              tuple(1, <span class="org-string">"b"</span>): set(2),
              tuple(2, <span class="org-string">""</span>):  set(0)]
    };
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(n.transition(0, <span class="org-string">"a"</span>) == set(1, 2));
}
</pre>
</div>
<p>
この例にあるNFAは文字列abまたはaに対してマッチする(=受理状態[2]に到達する)NFAです．繰り返しはでてきませんが，マッチする複数の文字列をNFAのグラフとして扱うイメージができるかと思います．
</p>

<p>
ところで，ここで集合を表すSet型の実装に悩むことになりました．
</p>
</div>
</div>

<div id="outline-container-org6dffcab" class="outline-3">
<h3 id="org6dffcab"><span class="section-number-3">3.2</span> コンパイル時Set</h3>
<div class="outline-text-3" id="text-3-2">
<p>
D言語のstd.containerでSet(集合)として使えるのは赤黒木RedBlackTreeクラスだけだと思うのですが，コンパイル時に動きませんでした&#x2026;．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> std.<span class="org-type">container</span>;
<span class="org-keyword">import</span> std.<span class="org-type">algorithm</span>;

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-variable-name">rbt</span> = redBlackTree(3, 1, 4, 2, 5);
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(equal(rbt[], [1, 2, 3, 4, 5])); <span class="org-comment-delimiter">// </span><span class="org-comment">Error: cannot cast ...  at compile time</span>
}
</pre>
</div>
<p>
<a href="https://wandbox.org/permlink/sy9FhfQd5Wwd2jpt">https://wandbox.org/permlink/sy9FhfQd5Wwd2jpt</a>
</p>

<p>
よく考えたら，赤黒木よりもC++のstd::unordered_setのように，ハッシュテーブルを使って実装したほうがシンプルで良いかも&#x2026;という思いもあり，D言語の組み込み連想配列(assoc)はコンパイル時に動くし，ハッシュテーブル実装なので，ラップして使いました．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">struct</span> <span class="org-type">Set</span>(<span class="org-type">T</span>) {
    <span class="org-keyword">struct</span> <span class="org-type">Value</span> {}
    <span class="org-type">Value</span>[T] <span class="org-variable-name">base</span>;
    <span class="org-keyword">alias</span> <span class="org-type">base</span> <span class="org-keyword">this</span>;

    <span class="org-keyword">this</span>(<span class="org-type">T</span>[] <span class="org-variable-name">xs</span>) {
        <span class="org-keyword">foreach</span> (x; xs) <span class="org-keyword">this</span>.base[x] = Value();
    }
}

<span class="org-type">void</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">enum</span> <span class="org-type">s</span> = Set<span class="org-negation-char">!</span><span class="org-type">int</span>([1, 2, 3]);
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>((1 <span class="org-keyword">in</span> s) != <span class="org-constant">null</span>);
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>((0 <span class="org-keyword">in</span> s) == <span class="org-constant">null</span>);
}
</pre>
</div>

<p>
実装も楽だし，たぶん速いし，コンパイル時に動くし，良いことばかりですね．
</p>
</div>
</div>

<div id="outline-container-org0aa9ae8" class="outline-3">
<h3 id="org0aa9ae8"><span class="section-number-3">3.3</span> コンパイル時DFA</h3>
<div class="outline-text-3" id="text-3-3">
<p>
DFAはNFAよりも複雑な遷移をしたくなるので，連想配列による遷移表mapではなく関数transで表すことにしました．注意点として NFA の遷移関数は <code>Set!State transition(State s, Input i)</code> でしたが，DFAは決定的なので <code>State transition(State s, Input i)</code> といった具合に戻り値が必ず一つの状態になることです．D言語はちゃんとした静的型付き言語なのに，私はスクリプト言語に型が勝手につく位の使い方をしてるので，読みづらくて申し訳ないです．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">struct</span> <span class="org-type">DFA</span>(<span class="org-type">State</span>, <span class="org-type">Input</span>, <span class="org-keyword">alias</span> <span class="org-type">trans</span>, Accepts = Set<span class="org-negation-char">!</span>State) {
    <span class="org-type">State</span> <span class="org-variable-name">start</span>;
    <span class="org-type">Accepts</span> <span class="org-variable-name">accepts</span>;
    <span class="org-keyword">alias</span> <span class="org-type">transition</span> = trans;
}

<span class="org-keyword">unittest</span> {
    <span class="org-comment-delimiter">/**</span>
<span class="org-comment">       DFA example</span>
<span class="org-comment">       -&gt; (1) -- a --&gt; (2) -- b --&gt; [3]</span>
<span class="org-comment">    */</span>
    <span class="org-keyword">enum</span> <span class="org-type">map</span> = [
        tuple(1, <span class="org-string">"a"</span>): 2,
        tuple(2, <span class="org-string">"b"</span>): 3,
        ];

    <span class="org-type">int</span> <span class="org-function-name">t</span>(<span class="org-type">int</span> <span class="org-variable-name">state</span>, <span class="org-type">string</span> <span class="org-variable-name">c</span>) {
        <span class="org-keyword">return</span> map.get(tuple(state, c), 0);
    }
    <span class="org-keyword">enum</span> <span class="org-type">DFA</span><span class="org-negation-char">!</span>(<span class="org-type">int</span>, <span class="org-type">string</span>, t) d = { start: 1, accepts: Set<span class="org-negation-char">!</span><span class="org-type">int</span>([3]) };
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#36983;&#31227;&#12375;&#12390;&#12415;&#12427;</span>
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>(d.transition(1, <span class="org-string">"a"</span>) == 2);
    <span class="org-keyword">static</span> <span class="org-keyword">assert</span>((d.transition(2, <span class="org-string">"b"</span>) <span class="org-keyword">in</span> dfa.accepts) != <span class="org-constant">null</span>);
}
</pre>
</div>

<p>
NFAと同様に，最終的に正規表現がマッチしているかの判定は遷移後の状態がaccepts集合に入っているかどうかまで簡単化されるので，このくらいの実装ならコンパイル時にマッチできることがわかります．
</p>
</div>
</div>

<div id="outline-container-org5caac97" class="outline-3">
<h3 id="org5caac97"><span class="section-number-3">3.4</span> 残りの部分を書く</h3>
<div class="outline-text-3" id="text-3-4">
<p>
実際のところ，これ以外の部分はもうやるだけです，とくにコンパイル時に動かないということはありませんでした．アドバイスとしてはプログラムが大きくなると何をやっているのか理解できなくなる＋コンパイル時に動かなくなることが多いので，モジュールをどんどん分割して簡単な変換例をunittestとして書き続けるのが良いと思います．意外にも組み合わせるとコンパイル時に動かなくなるということはほぼなく，どこかしらが局所的にコンパイルできないことが多いです．
</p>

<p>
以下ざっくりとした実装上のポイント解説です．
</p>
</div>

<div id="outline-container-org65ce224" class="outline-4">
<h4 id="org65ce224"><span class="section-number-4">3.4.1</span> 字句解析</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
<a href="https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/lexer.d">https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/lexer.d</a>
</p>

<p>
ここでは元ネタの正規表現エンジンに従って下記の数学的に使われる文法のみをサポートしました．
実用的な正規表現にでてくる + ? {} [] などは今回サポートしていませんが，それぞれ数学的な正規表現に変換できるので後回しにしてます．
</p>

<table id="orgbb304cd" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">&#34920;1:</span> 数学的な正規表現の文法</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">受理する文字列</th>
<th scope="col" class="org-left">Token列挙型</th>
<th scope="col" class="org-left">ASTクラス名</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">文字</td>
<td class="org-left">character</td>
<td class="org-left">Char</td>
</tr>

<tr>
<td class="org-left">A &vert; B</td>
<td class="org-left">AまたはBの集合</td>
<td class="org-left">opUnion</td>
<td class="org-left">Union</td>
</tr>

<tr>
<td class="org-left">AB</td>
<td class="org-left">AとBの連結</td>
<td class="org-left">なし</td>
<td class="org-left">Concat</td>
</tr>

<tr>
<td class="org-left">A*</td>
<td class="org-left">Aの繰り返し</td>
<td class="org-left">opStar</td>
<td class="org-left">Star</td>
</tr>

<tr>
<td class="org-left">(A)</td>
<td class="org-left">カッコ内を優先してマッチ</td>
<td class="org-left">left/rightParen</td>
<td class="org-left">なし</td>
</tr>
</tbody>
</table>

<p>
文字列からToken列への変換はよくあるswitch文を使ったものです．
</p>
</div>
</div>
