notes/d-compile-time-regex.org
*** 構文解析

https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/parser.d

構文解析では字句解析されたToken列をASTに割り当てていきます．よくあるBNFのような生成規則を思い浮かべて再帰的にASTを作ります．
#+begin_src ocaml
expression := subexpr EOF
subexpr    := seq '|' subexpr | seq
seq        := subseq | ''
subseq     := star subseq | star
star       := factor '*' | factor
factor     := '(' subexpr ')' | CHARACTER
#+end_src

*** 抽象構文木(AST)

https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/ast.d

構文解析時に上記の字句を図の右に示したASTクラスとして表現しています．ここでは主に表[[fig:regexp-syntax]]に示した受理を行うNFAへの変換を行います．
#+begin_src d
interface AST {
    /// 合成用のNFA型
    alias Fragment = NFAFragment!(int, dchar);
    /// 受理する文字列に対応したNFAに変換するメソッド
    Fragment assemble(scope ref Context ctx) const;
    /// 等価な字句か判定するメソッド
    bool opEquals(Object that) const;
    /// デバッグ用プリントに文字列化するメソッド
    string toString() const;
}
#+end_src

*** NFAからDFAへの変換

https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/automata.d#L150

この辺でだんだんとモチベーションが下がって二ヶ月くらい放置してました(90%終わってきたので...)．
やってることは元ネタと全く同じで部分集合構成法を使っています．ひとつだけ未だにコンパイル時に動かなくてハマっている部分があります．遷移関数の部分でコンパイル時に参照できないと怒られてしまうので，力技でコンパイル時版をコピペで書きました，ここだけはちゃんと書き直したいです．

#+begin_src d
/// 本当は nfa を関数の引数にしたかったが，怒られるのでテンプレート引数にして"とりあえず"動かした
auto nfa2dfa(State = int, Input = dchar, NFA!(int, dchar) nfa)() {
    import dfsa.set : DisjointSet;
    alias Arc = ArcT!(Set!State, Input);

    auto trans(const Set!State[Arc] map, Set!State state, Input c) {
        Set!State ret;
        foreach (elem; state) {
            ret = ret ~ nfa.transition(elem, c);
        }
        return nfa.epsExpand(ret);
    }

    alias D = DFA!(Set!State, Input, trans, DisjointSet!State);

    D dfa = {
        start: nfa.epsExpand(set(nfa.start)),
        accepts: DisjointSet!State(nfa.accept)
    };
    return dfa;
}
#+end_src

*** 正規表現のマッチ：受理判定

冒頭に説明したように正規表現を等価なDFAに変換した後は，ひたすら入力文字列に従って遷移して，最終的に受理状態に到達したか調べるだけなので何も難しいことはありません．

https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/automata.d#L85

** 動作検証

それでは，冒頭に示したコンパイル時に動かない例が動くようになったか検証してみます．

#+begin_src d
import dfsa.regexp;

enum nfa = parseNFA("(ABC*|abc*)*");
// alias NFA = typeof(parseNFA(string.init));
enum dfa = nfa2dfa!(int, dchar, nfa)();
alias match = (dstring s) => dfa.runtime.accept(s);
static assert(match("ABC"));
static assert(!match("ABBC"));
static assert(match("abcccABABC"));
static assert(!match("abABAb"));
static assert(match(""));
#+end_src

ちゃんとstatic assertが通っているのでコンパイル時に検証できました．

* まとめと課題

今回の収穫としては，コンパイル時に動くSet(集合)が手に入ったのが大きいのではないでしょうか．私はこれまでコンパイル時Setさえあれば...という経験が10回くらいあります．あとコンパイル時に動かすprecomputedパターンや，関数がCTFEで動かないときに無理やりテンプレート引数に突っ込んでコンパイラによろしくやってもらうパターン(?)も個人的には有用だったと思います．

正規表現エンジンとしては，とりあえず動いた．というレベルなので本格的に使い物になるようなライブラリにするには次のような課題があります．

- 冒頭に述べた実用的な正規表現の文法や ^ $ などのポピュラーな文法をサポートする
- CTFE用の ~nfa2dfa~ をかっこよくする
- ひたすら機能拡張を続けて [[https://github.com/hanickadot/compile-time-regular-expressions][C++のctre]] 並(つまりPCRE並)に高機能にする
- http://lh3lh3.users.sourceforge.net/reb.shtml などを参考にベンチマークをとって高速化する

始めは汎用な有限状態オートマトンの勉強がてらライブラリを作っていたのですが，正規表現の世界だけでも十分一生掛かりそうな技法があり面白いです．今回はふれなかったBackTrackingによる実装など，のんびりと趣味で続けていこうと思います．

