notes/d-compile-time-regex.html

<div id="outline-container-orgc4ecbaf" class="outline-4">
<h4 id="orgc4ecbaf"><span class="section-number-4">3.4.2</span> 構文解析</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
<a href="https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/parser.d">https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/parser.d</a>
</p>

<p>
構文解析では字句解析されたToken列をASTに割り当てていきます．よくあるBNFのような生成規則を思い浮かべて再帰的にASTを作ります．
</p>
<div class="org-src-container">
<pre class="src src-ocaml">expression := subexpr EOF
subexpr    := seq '|' subexpr | seq
seq        := subseq | ''
subseq     := star subseq | star
star       := factor '*' | factor
factor     := '(' subexpr ')' | CHARACTER
</pre>
</div>
</div>
</div>

<div id="outline-container-org5fb3aa7" class="outline-4">
<h4 id="org5fb3aa7"><span class="section-number-4">3.4.3</span> 抽象構文木(AST)</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
<a href="https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/ast.d">https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/ast.d</a>
</p>

<p>
構文解析時に上記の字句を図の右に示したASTクラスとして表現しています．ここでは主に表<a href="#orgbb304cd">1</a>に示した受理を行うNFAへの変換を行います．
</p>
<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">interface</span> <span class="org-type">AST</span> {
    <span class="org-comment-delimiter">/// </span><span class="org-comment">&#21512;&#25104;&#29992;&#12398;NFA&#22411;</span>
    <span class="org-keyword">alias</span> <span class="org-type">Fragment</span> = NFAFragment<span class="org-negation-char">!</span>(<span class="org-type">int</span>, <span class="org-type">dchar</span>);
    <span class="org-comment-delimiter">/// </span><span class="org-comment">&#21463;&#29702;&#12377;&#12427;&#25991;&#23383;&#21015;&#12395;&#23550;&#24540;&#12375;&#12383;NFA&#12395;&#22793;&#25563;&#12377;&#12427;&#12513;&#12477;&#12483;&#12489;</span>
    <span class="org-type">Fragment</span> <span class="org-function-name">assemble</span>(<span class="org-keyword">scope</span> <span class="org-keyword">ref</span> <span class="org-type">Context</span> <span class="org-variable-name">ctx</span>) <span class="org-keyword">const</span>;
    <span class="org-comment-delimiter">/// </span><span class="org-comment">&#31561;&#20385;&#12394;&#23383;&#21477;&#12363;&#21028;&#23450;&#12377;&#12427;&#12513;&#12477;&#12483;&#12489;</span>
    <span class="org-type">bool</span> <span class="org-function-name">opEquals</span>(<span class="org-type">Object</span> <span class="org-variable-name">that</span>) <span class="org-keyword">const</span>;
    <span class="org-comment-delimiter">/// </span><span class="org-comment">&#12487;&#12496;&#12483;&#12464;&#29992;&#12503;&#12522;&#12531;&#12488;&#12395;&#25991;&#23383;&#21015;&#21270;&#12377;&#12427;&#12513;&#12477;&#12483;&#12489;</span>
    <span class="org-type">string</span> <span class="org-function-name">toString</span>() <span class="org-keyword">const</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1e1c5b" class="outline-4">
<h4 id="orgb1e1c5b"><span class="section-number-4">3.4.4</span> NFAからDFAへの変換</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
<a href="https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/automata.d#L150">https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/automata.d#L150</a>
</p>

<p>
この辺でだんだんとモチベーションが下がって二ヶ月くらい放置してました(90%終わってきたので&#x2026;)．
やってることは元ネタと全く同じで部分集合構成法を使っています．ひとつだけ未だにコンパイル時に動かなくてハマっている部分があります．遷移関数の部分でコンパイル時に参照できないと怒られてしまうので，力技でコンパイル時版をコピペで書きました，ここだけはちゃんと書き直したいです．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-comment-delimiter">/// </span><span class="org-comment">&#26412;&#24403;&#12399; nfa &#12434;&#38306;&#25968;&#12398;&#24341;&#25968;&#12395;&#12375;&#12383;&#12363;&#12387;&#12383;&#12364;&#65292;&#24594;&#12425;&#12428;&#12427;&#12398;&#12391;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#24341;&#25968;&#12395;&#12375;&#12390;"&#12392;&#12426;&#12354;&#12360;&#12378;"&#21205;&#12363;&#12375;&#12383;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">nfa2dfa</span>(State = <span class="org-type">int</span>, Input = <span class="org-type">dchar</span>, NFA<span class="org-negation-char">!</span>(<span class="org-type">int</span>, <span class="org-type">dchar</span>) nfa)() {
    <span class="org-keyword">import</span> dfsa.<span class="org-type">set</span> : DisjointSet;
    <span class="org-keyword">alias</span> <span class="org-type">Arc</span> = ArcT<span class="org-negation-char">!</span>(Set<span class="org-negation-char">!</span>State, Input);

    <span class="org-keyword">auto</span> <span class="org-function-name">trans</span>(<span class="org-keyword">const</span> <span class="org-variable-name">Set</span><span class="org-negation-char">!</span>State[Arc] map, Set<span class="org-negation-char">!</span>State state, <span class="org-type">Input</span> <span class="org-variable-name">c</span>) {
        Set<span class="org-negation-char">!</span>State <span class="org-variable-name">ret</span>;
        <span class="org-keyword">foreach</span> (elem; state) {
            ret = ret ~ nfa.transition(elem, c);
        }
        <span class="org-keyword">return</span> nfa.epsExpand(ret);
    }

    <span class="org-keyword">alias</span> <span class="org-type">D</span> = DFA<span class="org-negation-char">!</span>(Set<span class="org-negation-char">!</span>State, Input, trans, DisjointSet<span class="org-negation-char">!</span>State);

    <span class="org-type">D</span> <span class="org-variable-name">dfa</span> = {
        start: nfa.epsExpand(set(nfa.start)),
        accepts: DisjointSet<span class="org-negation-char">!</span>State(nfa.accept)
    };
    <span class="org-keyword">return</span> dfa;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf12131" class="outline-4">
<h4 id="orgcf12131"><span class="section-number-4">3.4.5</span> 正規表現のマッチ：受理判定</h4>
<div class="outline-text-4" id="text-3-4-5">
<p>
冒頭に説明したように正規表現を等価なDFAに変換した後は，ひたすら入力文字列に従って遷移して，最終的に受理状態に到達したか調べるだけなので何も難しいことはありません．
</p>

<p>
<a href="https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/automata.d#L85">https://github.com/ShigekiKarita/d-fsa/blob/v0.0.1/source/dfsa/automata.d#L85</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org80f84e7" class="outline-3">
<h3 id="org80f84e7"><span class="section-number-3">3.5</span> 動作検証</h3>
<div class="outline-text-3" id="text-3-5">
<p>
それでは，冒頭に示したコンパイル時に動かない例が動くようになったか検証してみます．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> dfsa.<span class="org-type">regexp</span>;

<span class="org-keyword">enum</span> <span class="org-type">nfa</span> = parseNFA(<span class="org-string">"(ABC*|abc*)*"</span>);
<span class="org-comment-delimiter">// </span><span class="org-comment">alias NFA = typeof(parseNFA(string.init));</span>
<span class="org-keyword">enum</span> <span class="org-type">dfa</span> = nfa2dfa<span class="org-negation-char">!</span>(<span class="org-type">int</span>, <span class="org-type">dchar</span>, nfa)();
<span class="org-keyword">alias</span> <span class="org-type">match</span> = (<span class="org-type">dstring</span> <span class="org-variable-name">s</span>) =&gt; dfa.runtime.accept(s);
<span class="org-keyword">static</span> <span class="org-keyword">assert</span>(match(<span class="org-string">"ABC"</span>));
<span class="org-keyword">static</span> <span class="org-keyword">assert</span>(<span class="org-negation-char">!</span>match(<span class="org-string">"ABBC"</span>));
<span class="org-keyword">static</span> <span class="org-keyword">assert</span>(match(<span class="org-string">"abcccABABC"</span>));
<span class="org-keyword">static</span> <span class="org-keyword">assert</span>(<span class="org-negation-char">!</span>match(<span class="org-string">"abABAb"</span>));
<span class="org-keyword">static</span> <span class="org-keyword">assert</span>(match(<span class="org-string">""</span>));
</pre>
</div>

<p>
ちゃんとstatic assertが通っているのでコンパイル時に検証できました．
</p>
</div>
</div>
</div>

<div id="outline-container-org211d8d8" class="outline-2">
<h2 id="org211d8d8"><span class="section-number-2">4</span> まとめと課題</h2>
<div class="outline-text-2" id="text-4">
<p>
今回の収穫としては，コンパイル時に動くSet(集合)が手に入ったのが大きいのではないでしょうか．私はこれまでコンパイル時Setさえあれば&#x2026;という経験が10回くらいあります．あとコンパイル時に動かすprecomputedパターンや，関数がCTFEで動かないときに無理やりテンプレート引数に突っ込んでコンパイラによろしくやってもらうパターン(?)も個人的には有用だったと思います．
</p>

<p>
正規表現エンジンとしては，とりあえず動いた．というレベルなので本格的に使い物になるようなライブラリにするには次のような課題があります．
</p>

<ul class="org-ul">
<li>冒頭に述べた実用的な正規表現の文法や ^ $ などのポピュラーな文法をサポートする</li>
<li>CTFE用の <code>nfa2dfa</code> をかっこよくする</li>
<li>ひたすら機能拡張を続けて <a href="https://github.com/hanickadot/compile-time-regular-expressions">C++のctre</a> 並(つまりPCRE並)に高機能にする</li>
<li><a href="http://lh3lh3.users.sourceforge.net/reb.shtml">http://lh3lh3.users.sourceforge.net/reb.shtml</a> などを参考にベンチマークをとって高速化する</li>
</ul>

<p>
始めは汎用な有限状態オートマトンの勉強がてらライブラリを作っていたのですが，正規表現の世界だけでも十分一生掛かりそうな技法があり面白いです．今回はふれなかったBackTrackingによる実装など，のんびりと趣味で続けていこうと思います．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Shigeki Karita</p>
<p class="date">Created: 2020-04-18 Sat 20:09</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
